export type EventInfo = {
  eventNo: string;
  year: string;
  name: string;
};

export const EVENTS: { [key: string]: { [key: string]: EventInfo } } = {
  홍천: {
    "2022": {
      eventNo: "2022090403",
      year: "2022",
      name: "홍천그란폰도",
    },
    "2023": {
      eventNo: "2023041602",
      year: "2023",
      name: "홍천그란폰도",
    },
    "2024": {
      eventNo: "2024042803",
      year: "2024",
      name: "홍천그란폰도",
    },
    "2025": {
      eventNo: "2025041903",
      year: "2025",
      name: "홍천그란폰도",
    },
  },
  양양: {
    "2024": {
      eventNo: "2024042701",
      year: "2024",
      name: "양양그란폰도",
    },
    "2025": {
      eventNo: "2025042601",
      year: "2025",
      name: "양양그란폰도",
    },
  },
  설악: {
    "2022": {
      eventNo: "2022061801",
      year: "2022",
      name: "설악그란폰도",
    },
    "2023": {
      eventNo: "2023052001",
      year: "2023",
      name: "설악그란폰도",
    },
    "2024": {
      eventNo: "2024051801",
      year: "2024",
      name: "설악그란폰도",
    },
    "2025": {
      eventNo: "2025051702",
      year: "2025",
      name: "설악그란폰도",
    },
  },
  영산강: {
    "2025": {
      eventNo: "2025042604",
      year: "2025",
      name: "영산강그란폰도",
    },
    "2024": {
      eventNo: "2024051103",
      year: "2024",
      name: "영산강그란폰도",
    },
    "2023": {
      eventNo: "2023052801",
      year: "2023",
      name: "영산강그란폰도",
    },
  },
  정읍내장산: {
    "2025": {
      eventNo: "2025060103",
      year: "2025",
      name: "정읍내장산 그란폰도",
    },
    "2024": {
      eventNo: "2024052601",
      year: "2024",
      name: "정읍내장산 그란폰도",
    },
    "2023": {
      eventNo: "2023062502",
      year: "2023",
      name: "정읍내장산 그란폰도",
    },
  },
  정읍내장산KOM: {
    "2025": {
      eventNo: "2025060104",
      year: "2025",
      name: "정읍내장산KOM",
    },
  },
  문경새재: {
    "2025": {
      eventNo: "2025090601",
      year: "2025",
      name: "문경새재 그란폰도",
    },
    "2024": {
      eventNo: "2024090102",
      year: "2024",
      name: "문경새재 그란폰도",
    },
    "2023": {
      eventNo: "2023090303",
      year: "2023",
      name: "문경새재 그란폰도",
    },
  },
  화천: {
    "2025": {
      eventNo: "2025051101",
      year: "2025",
      name: "화천 DMZ 렐리",
    },
    "2024": {
      eventNo: "2024051204",
      year: "2024",
      name: "화천 DMZ 렐리",
    },
    "2023": {
      eventNo: "2023051402",
      year: "2023",
      name: "화천 DMZ 렐리",
    },
    "2022": {
      eventNo: "2022101604",
      year: "2022",
      name: "화천 DMZ 렐리",
    },
  },
  홍천KOM: {
    "2025": {
      eventNo: "2025041904",
      year: "2025",
      name: "홍천KOM",
    },
    "2024": {
      eventNo: "2024042805",
      year: "2024",
      name: "홍천KOM",
    },
    "2023": {
      eventNo: "2023041603",
      year: "2023",
      name: "홍천KOM",
    },
  },
  고성: {
    "2025": {
      eventNo: "2025032901",
      year: "2025",
      name: "공룡나라 그란폰도",
    },
    "2024": {
      eventNo: "2024033001",
      year: "2024",
      name: "공룡나라 그란폰도",
    },
    "2023": {
      eventNo: "2023111101",
      year: "2023",
      name: "고성 공룡나라 그란폰도",
    },
  },
  여수: {
    "2023": {
      eventNo: "2023111802",
      year: "2023",
      name: "섬섬여수 그란폰도",
    },
    "2022": {
      eventNo: "2022112003",
      year: "2022",
      name: "섬섬여수 그란폰도",
    },
  },
  삼척: {
    "2025": {
      eventNo: "2025060703",
      year: "2025",
      name: "삼척 그란폰도",
    },
    "2024": {
      eventNo: "2024060902",
      year: "2024",
      name: "삼척 그란폰도",
    },
  },
  삼척KOM: {
    "2025": {
      eventNo: "2025060704",
      year: "2025",
      name: "삼척KOM",
    },
  },
  부여: {
    "2024": {
      eventNo: "2024101203",
      year: "2024",
      name: "부여 굿뜨래 그란폰도",
    },
    "2023": {
      eventNo: "2023102101",
      year: "2023",
      name: "부여 굿뜨래 그란폰도",
    },
  },
  연천: {
    "2025": {
      eventNo: "2025062101",
      year: "2025",
      name: "서울신문연천DMZ랠리",
    },
    "2024": {
      eventNo: "2024061501",
      year: "2024",
      name: "연천DMZ 렐리",
    },
  },
  상주: {
    "2024": {
      eventNo: "2024100501",
      year: "2024",
      name: "상주 그란폰도",
    },
  },
  양평: {
    "2023": {
      eventNo: "2023100901",
      year: "2023",
      name: "양평 그란폰도",
    },
  },
  홍천강: {
    "2023": {
      eventNo: "2023092301",
      year: "2023",
      name: "홍천강 그란폰도",
    },
  },
  진안: {
    "2023": {
      eventNo: "2023090901",
      year: "2023",
      name: "뚜르 진안고원",
    },
    "2022": {
      eventNo: "2022092504",
      year: "2022",
      name: "뚜르 진안고원",
    },
  },
  지리산: {
    "2023": {
      eventNo: "2023050601",
      year: "2023",
      name: "지리산 그란폰도",
    },
    "2022": {
      eventNo: "2022091805",
      year: "2022",
      name: "지리산 그란폰도",
    },
  },
};
